<center><h2> Exercício Final
</center>

3 arquivos estão sendo postados aqui: cadastro.csv; preço da gasolina.csv; salario_professioes.csv.<br>
Diante desses 3 arquivos, o trabalho deve responder as seguintes perguntas:

Qual a idade média das pessoas no cadastro ?<br>
Quantos homens tem no cadastro ?<br>
Quantas mulheres tem no cadastro ?<br>
Qual a idade média dos homens e das mulheres ?<br>
Crie um gráfico de barras e mostre a distribuição de escolaridade no cadastro ?<br>
Mostre a Média Salarial do cadastro ?<br>
Quem tem o maior salário ?<br>
Tirando desempregado quem recebe menos ?<br>
Quantas pessoas gostam de caminhar no final de semana ?<br>
Crie um gráfico mostrando entre a relação de escolaridade e quem pratica esporte ?<br>
Crie um mapa de calor ?<br>
Mostre de forma gráfica a distribuição de estados do cadastro ?<br>

In [1]:
#importando a biblioteca do pandas (https://pandas.pydata.org/)
import pandas as pd

In [6]:
#importando os arquivos
cadastro = pd.read_csv('C:/Users/Ludmi/Documents/AulaPhyton/Exercicios/arquivos/cadastro.csv')
gasolina = pd.read_csv('C:/Users/Ludmi/Documents/AulaPhyton/Exercicios/arquivos/preco_da_gasolina.csv')
salario = pd.read_csv('C:/Users/Ludmi/Documents/AulaPhyton/Exercicios/arquivos/salario_profissoes.csv')

<b>Qual a idade média das pessoas no cadastro ?</b><br>

In [17]:
# Descobrindo a quantidade de linhas
cadastro.shape[0]

30

In [12]:
#Inserindo uma coluna Idade no arquivo com o cálculo da idade
cadastro['Idade'] = (2020-cadastro.ano_nascimento)

In [15]:
#Renomeando a coluna idade porque eu nomeei com maiusculo
cadastro = cadastro.rename(columns={"Idade": "idade"})
cadastro.head(4)

,nome,sobrenome,ano_nascimento,sexo,cidade,profissão,experiencia profissional,estado_civil,filhos,lazer_final_de_semana,pratica_esporte,qual_esporte,quanta_vezes_na_semana_pratica_esporte,tem carro,escolaridade,idade
0,Dirceu,Manolo,1985,m,São Vicente,Cientista de Dados,4,Casado,1,"estudar, academia, jogar video game,surfar",sim,academia,3.0,sim,Ensino Superior,35
1,Maria,Silva,1970,f,Santos,dona de casa,2,Casada,3,ver tv,não,-,0.0,não,Ensino Médio,50
2,Adalberto,Martins,1990,m,São Paulo,desempregado,0,Solteiro,1,jogar bola,sim,jogo bola,2.0,sim,Ensino Superior,30
3,João,Aparecido,1950,m,Monte Alto,Gerente de Projeto,3,Viuvo,2,Nã faço nada,NaN,-,NaN,sim,Ensino Superior,70

In [25]:
# Fazendo a média: divindo a soma de todas as idades pela quantidade de linhas
media = ((cadastro.idade.sum())/(cadastro.shape[0]))

#Exibindo a média
print ("A média de idade das pessoas do cadastro é em torno de : ",round(media)," anos")

A média de idade das pessoas do cadastro é em torno de :  33.0  anos

<b>Quantos homens tem no cadastro ?</b><br>

In [27]:
#Inserindo uma coluna de contador
cadastro['contador'] = 1
cadastro.head(1)

,nome,sobrenome,ano_nascimento,sexo,cidade,profissão,experiencia profissional,estado_civil,filhos,lazer_final_de_semana,pratica_esporte,qual_esporte,quanta_vezes_na_semana_pratica_esporte,tem carro,escolaridade,idade,contador
0,Dirceu,Manolo,1985,m,São Vicente,Cientista de Dados,4,Casado,1,"estudar, academia, jogar video game,surfar",sim,academia,3.0,sim,Ensino Superior,35,1

In [28]:
# Agrupando por sexo pra verificar se tem mais de uma categoria de Sexo:

cadastro[['sexo', 'contador']].groupby("sexo").sum()

      contador
sexo
f           14
m           16

In [38]:

# criando um dataframe somente com os homens
homens = cadastro.loc[(cadastro.sexo=='m')]
homens.head(4)

#criando uma variável para armazenar a quantidade de linhas com homens
qtd_homens= homens.shape[0]

#Exibindo a quantidade de homens:
print ("No cadastro tem ",qtd_homens," homens")

No cadastro tem  16  homens

<b>Quantas mulheres tem no cadastro ?</b><br>

In [39]:
# criando um dataframe somente com os mulheres
mulheres = cadastro.loc[(cadastro.sexo=='f')]
mulheres.head(4)

#criando uma variável para armazenar a quantidade de linhas com mulheres
qtd_mulheres= mulheres.shape[0]

#Exibindo a quantidade de mulheres:
print ("No cadastro tem ",qtd_mulheres," mulheres")

No cadastro tem  14  mulheres

<b>Qual a idade média dos homens e das mulheres? </b><br>

In [48]:
#Criando uma variável para armazenar a idade média dos homens: dividindo o total da idade de homens pelo total de homens

idade_homens = round(((homens.idade.sum())/(homens.contador.sum())))

#Criando uma variável para armazenar a idade média das mulheres: dividindo o total da idade de mulheres pelo total de mulheres

idade_mulheres = round(((mulheres.idade.sum())/(mulheres.contador.sum())))

#Exibindo a média de homens e mulheres:

print ("A média de idade de homens é de ",idade_homens," anos e a de mulheres é de ", idade_mulheres, " anos")

A média de idade de homens é de  32.0  anos e a de mulheres é de  34.0  anos

<b>Crie um gráfico de barras e mostre a distribuição de escolaridade no cadastro: </b><br>

In [64]:
# Fazendo um group by para ver se é necessário corrigir o cadastro:

cadastro[['escolaridade', 'contador']].groupby("escolaridade").sum()

                 contador
escolaridade
Ensino Médio            4
Ensino Superior        12
ensino Médio            1
ensino médio            3
ensino superior         9
ensino tecnico          1

In [67]:
# Corrigindo o cadastro com o Replace:
cadastro= cadastro.replace('Ensimo Tecnico','ensino tecnico')

cadastro= cadastro.replace('ensino Médio','ensino médio')

cadastro= cadastro.replace('Ensino Superior','ensino superior')

cadastro= cadastro.replace('ensino médio','ensino medio')

In [68]:
#Novo group by pra ver se funcionou

cadastro[['escolaridade', 'contador']].groupby("escolaridade").sum()

                 contador
escolaridade
ensino medio            8
ensino superior        21
ensino tecnico          1

In [83]:
#Criando um dataframe para cada tipo de escolaridade
ensino_medio = cadastro.loc[(cadastro.escolaridade=='ensino medio')]
ensino_superior = cadastro.loc[(cadastro.escolaridade=='ensino superior')]
ensino_tecnico = cadastro.loc[(cadastro.escolaridade=='ensino tecnico')]

In [84]:
#criando um array com a soma de cada escolaridade

array_grafico=[(ensino_medio.contador.sum()),(ensino_superior.contador.sum()),(ensino_tecnico.contador.sum())]

array_grafico

[8, 21, 1]

<b>Mostre a Média Salarial do cadastro: </b><br>

In [99]:
# Fazendo um group by para ver se é necessário corrigir o cadastro:

cadastro[['profissão', 'contador']].groupby("profissão").sum()

                        contador
profissão
Analista de Sistemas           1
Autonoma                       1
Auxiliar de Enfermagem         1
Biomedica                      1
Caminhoneiro                   2
Cientista de Dados             1
Comercio Exterior              1
Dentista                       1
Enfermeira                     2
Frentista                      1
Gerente Financeiro             2
Gerente Geral                  1
Gerente de Projeto             1
Médica                         1
Nutricionista                  1
Não informado                  1
Pedreiro                       1
Professora                     1
Recursos Humanos               1
caixa de mercado               1
desempregado                   2
dona de casa                   1
estagiario                     2
estudante                      2

In [101]:
#Inserindo uma coluna de contador
salario['contadorsalario'] = 1

In [106]:
salario[['Profissões','contadorsalario']].groupby("Profissões").sum()

                        contadorsalario
Profissões
Analista de Sistemas                  1
Autonoma                              1
Auxiliar de Enfermagem                1
Biomedica                             1
Caminhoneiro                          1
Cientista de Dados                    1
Comercio Exterior                     1
Dentista                              1
Enfermeira                            1
Frentista                             1
Gerente Financeiro                    1
Gerente Geral                         1
Gerente de Projeto                    1
Médica                                1
Nutricionista                         1
Pedreiro                              1
Professora                            1
Recursos Humanos                      1
caixa de mercado                      1
desempregado                          1
dona de casa                          1
estagiario                            1
estudante                             1

In [151]:
#renomeando a coluna Profissões
salario = salario.rename(columns={"Profissões": "profissão"})
salario.head(1)

            profissão  salario até 3 anos  salaior +3 anos  contadorsalario
0  Cientista de Dados               10000            14000                1

In [ ]:
#merge entre cadastro e salario

cadastro=cadastro.merge(salario, left_on='profissão', right_on='profissão')

In [122]:
#Renomeando Experiencia profissional para Experiencia

cadastro = cadastro.rename(columns={"experiencia profissional": "experiencia"})

In [139]:
#criando uma coluna nome_sobrenome e concatenando nome e sobrenome

new = cadastro["sobrenome"].copy()
cadastro["nomesobrenome"]= cadastro["nome"].str.cat(new, sep ='')

In [142]:
#criando 2 dataframes para separar a experiencia profissional

experiencia_ate_tres= cadastro.loc[(cadastro.experiencia<=3)]

experiencia_maior_tres=cadastro.loc[(cadastro.experiencia>3)]

In [146]:
#Deixando somente a coluna nomesobrenome e salario para facilitar
experiencia_ate_tres = experiencia_ate_tres[['nomesobrenome','salario até 3 anos']]
experiencia_ate_tres = experiencia_ate_tres.rename(columns={"salario até 3 anos": "salarioreal"})

In [148]:
experiencia_ate_tres.head(4)

        nomesobrenome  salarioreal
1          MariaSilva         1200
2    AdalbertoMartins            0
3  LucasSilva e Silva            0
4       JoãoAparecido         5000

In [150]:
#Deixando somente a coluna nomesobrenome e salario para facilitar
experiencia_maior_tres = experiencia_maior_tres[['nomesobrenome','salaior +3 anos']]
experiencia_maior_tres = experiencia_maior_tres.rename(columns={"salaior +3 anos": "salarioreal"})
experiencia_maior_tres.head(4)

       nomesobrenome  salarioreal
0       DirceuManolo        14000
6       VilmaNarsiza         1200
9                NaN        20000
12  JaquelineVirtude         7000

In [164]:
#Obtendo total e quantidade de salarios até 3 anos
total_ate_tres = experiencia_ate_tres.salarioreal.sum()
qtd_ate_tres= experiencia_ate_tres.salarioreal.count()

19

In [165]:
#Obtendo total e quantidade de salarios maior que 3 anos
total_maior_tres = experiencia_maior_tres.salarioreal.sum()
qtd_maior_tres = experiencia_maior_tres.salarioreal.count()

In [171]:
#Obtendo e exibindo a média:

media_cadastro=((total_ate_tres+total_maior_tres)/(qtd_ate_tres+qtd_maior_tres))

print ("A média de salarios é :", round(media_cadastro))

A média de salarios é : 4617.0

<b>Quem tem o maior salário? </b><br>

In [175]:
#Instanciando uma variável salario maior e nome salario maior
salario_maior=0
nome_salario_maior = 0

In [183]:
#Instanciando uma variável para receber o maior valor até tres anos
salario_maior_ate_tres= experiencia_ate_tres.salarioreal.max()


nomeSobrenomeAteTres = experiencia_ate_tres.loc[(experiencia_ate_tres.salarioreal==experiencia_ate_tres.salarioreal.max())]

In [188]:
#Instanciando uma variável para receber o maior valor maior que 3 anos
salario_maior_maior_tres= experiencia_maior_tres.salarioreal.max()

nomeSobrenomeMaiorTres=experiencia_maior_tres.loc[(experiencia_maior_tres.salarioreal==experiencia_maior_tres.salarioreal.max())]

In [179]:
# Verificando qual dos salários é maior e exibindo
if(salario_maior_ate_tres>salario_maior_maior_tres):
    salario_maior = salario_maior_ate_tres
    nome_salario_maior = nomeSobrenomeAteTres.nomesobrenome
else:
    salario_maior = salario_maior_maior_tres
    nome_salario_maior = nomeSobrenomeMaiorTres.nomesobrenome
salario_maior

20000